Tekla.Structures.Geometry3d.CoordinateSystemConversions
The Tekla.Structures.Geometry3d.CoordinateSystemConversions class converts values representing coordinate systems.

Tekla.Structures.Geometry3d.CoordinateSystemConversions.ToCoordinateSystem3(Tekla.Structures.Geometry3d.CoordinateSystem)
Converts a Tekla.Structures.Geometry3d.CoordinateSystem to a Tekla.BIM.Geometry.CoordinateSystem3.
coordinateSystem: The Tekla.Structures.Geometry3d.CoordinateSystem to convert.
Returns: The resulting Tekla.BIM.Geometry.CoordinateSystem3.

Tekla.Structures.Geometry3d.CoordinateSystemConversions.ToCoordinateSystem(Tekla.BIM.Geometry.CoordinateSystem3)
Converts a Tekla.BIM.Geometry.CoordinateSystem3 to a Tekla.Structures.Geometry3d.CoordinateSystem.
coordinateSystem: The Tekla.BIM.Geometry.CoordinateSystem3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.CoordinateSystem.